#include <stdio.h>
#include <stdlib.h>
int main(){
	int input,sum,left,r1000,r500,r200,r100,r50,r10,r5,r1;
	printf("==找零系統==\n");
	printf("請輸入付款金額:");
	scanf("%d", &input);
	printf("請輸入消費總額:");
	scanf("%d", &sum);
	printf("\n\n==找零函式==\n");
	printf("1000元	500元	200元	100元	50元	10元	5元	1元\n");
	printf("-------------------------------------------------------------\n");
	left=input-sum;
	r1000=left/1000;
	r500=(left-r1000*1000)/500;
	r200=(left-r1000*1000-r500*500)/200;
	r100=(left-r1000*1000-r500*500-r200*200)/100;
	r50=(left-r1000*1000-r500*500-r200*200-r100*100)/50;
	r10=(left-r1000*1000-r500*500-r200*200-r100*100-r50*50)/10;
	r5=(left-r1000*1000-r500*500-r200*200-r100*100-r50*50-r10*10)/5;
	r1=(left-r1000*1000-r500*500-r200*200-r100*100-r50*50-r10*10-r5*5);
	printf("%d張	%d張	%d張	%d張	%d張	%d張	%d張	%d張\n",r1000,r500,r200,r100,r50,r10,r5,r1);
	system("pause");
}
